Data Analysis with Pandas and SQL

In [1]:
import numpy as np
import pandas as pd

In [2]:
# we can manually install tools
# outside of anaconda we write pip install pandasql
# !conda install pandasql --yes

In [3]:
# we import the sql tools like this
from pandasql import sqldf

In [4]:
# we need some data
students= {
    'Students':["Sira","Ibrahim","Moussa","Mamadou","Nabintou"],
    'Gender':['Female','Male','Fluid', "Male", "Female"],
    'Age':[18, 27, 19, 22, 21],
    'Email': ["sira@info.com", "ib@info.com", "mouss@info.com", 
             "mam@info.com", "nab@info.com"]
          }
teaching_assistant= {
    'Teacher':["Ibrahim","Nabintou","Mamadou","Fatim","Aziz"],
    'Email':['ib@info.com','nab@info.com','mam@info.com', 
             "fat@info.com", "aziz@info.com"],
    'Degree':["MSc. in Data Science", "BSc. in Statistics", 
              "BSc. Comp Sci", "MSc. Architecture", "BSc. in Accounting"],
    'Department': ["Business", "Statistics", "Comp Sci", 
             "Engineering", "Business"]
          }

In [6]:
# make them into DataFrames
students_df = pd.DataFrame(students)
students_df

   Students  Gender  Age           Email
0      Sira  Female   18   sira@info.com
1   Ibrahim    Male   27     ib@info.com
2    Moussa   Fluid   19  mouss@info.com
3   Mamadou    Male   22    mam@info.com
4  Nabintou  Female   21    nab@info.com

In [7]:
teaching_assistant_df = pd.DataFrame(teaching_assistant)
teaching_assistant_df

    Teacher          Email                Degree   Department
0   Ibrahim    ib@info.com  MSc. in Data Science     Business
1  Nabintou   nab@info.com    BSc. in Statistics   Statistics
2   Mamadou   mam@info.com         BSc. Comp Sci     Comp Sci
3     Fatim   fat@info.com     MSc. Architecture  Engineering
4      Aziz  aziz@info.com    BSc. in Accounting     Business

We will select data, filter data, aggregate and join data using SQL on DataFrames

In [23]:
# CAREFUL - avoid keywords such as 'all'
all_s = sqldf("SELECT * FROM students_df") # * means all columns
# all_s = sqldf("SELECT Age, Email FROM students_df") # we can specify which clumns
all_s.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Students  5 non-null      object
 1   Gender    5 non-null      object
 2   Age       5 non-null      int64
 3   Email     5 non-null      object
dtypes: int64(1), object(3)
memory usage: 288.0+ bytes

In [21]:
# select a limited subset
query = "SELECT Students, Email FROM all_s LIMIT 3"
# query = "SELECT Students, Email FROM students_df LIMIT 3"
subset = sqldf(query)
subset

  Students           Email
0     Sira   sira@info.com
1  Ibrahim     ib@info.com
2   Moussa  mouss@info.com